

#Область ПрограмныйИнтерфейс

Процедура ДополнитьФорму(Форма) Экспорт
	
	//++ Мещанкин И.В. Задание 11.2.2  02/10/25
	// Добавление дополнительных полей.
	
	ИмяФормы = Форма.ИмяФормы;
	
	Если ИмяФормы = "Документ.ЗаказПокупателя.Форма.ФормаДокумента" Тогда
		ДобавитьПолеКонтактноеЛицоВГруппуШапкаПраво(Форма);
		ДобавитьГруппуСкидкаПолеСкидка(Форма);
		ДобавитьКнопкуРасчитать(Форма)
	ИначеЕсли ИмяФормы = "Документ.ПоступлениеТоваровУслуг.Форма.ФормаДокумента" Тогда
		ДобавитьПолеКонтактноеЛицоВГруппуШапкаПраво(Форма);
	ИначеЕсли ИмяФормы = "Документ.РеализацияТоваровУслуг.Форма.ФормаДокумента" Тогда
		ДобавитьПолеКонтактноеЛицоВГруппуШапкаПраво(Форма);
	ИначеЕсли ИмяФормы = "Документ.ОплатаОтПокупателя.Форма.ФормаДокумента" Тогда
		ВставитьПолеКонтактноеЛицоНаФормуПередСуммаДокумента(Форма);
	ИначеЕсли ИмяФормы = "Документ.ОплатаПоставщику.Форма.ФормаДокумента" Тогда
		ВставитьПолеКонтактноеЛицоНаФормуПередСуммаДокумента(Форма);
	КонецЕсли;
	//--	
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс 

Процедура ДобавитьПолеКонтактноеЛицоВГруппуШапкаПраво(Форма)
	//++ Мещанкин И.В. Задание 11.2.2  02/10/25
	
	ПолеВвода = Форма.Элементы.Добавить("ИВМ_КонтактноеЛицо", Тип("ПолеФормы"), Форма.Элементы.ГруппаШапкаПраво);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.ИВМ_КонтактноеЛицо";
	//--
КонецПроцедуры

Процедура ДобавитьГруппуСкидкаПолеСкидка(Форма)
	//++ Мещанкин И.В. Задание 11.2.2  02/10/25
	
	// Добавление группы
	
	ГруппаСкидка = Форма.Элементы.Вставить("Скидка", Тип("ГруппаФормы"),,Форма.Элементы.Страницы);
	ГруппаСкидка.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаСкидка.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	ГруппаСкидка.ОтображатьЗаголовок = Ложь;
	
	// Добавление поля 
	
	ПолеВвода = Форма.Элементы.Добавить("ИВМ_СогласованнаяСкидка", Тип("ПолеФормы"), Форма.Элементы.Скидка);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.ИВМ_СогласованнаяСкидка";
	ПолеВвода.УстановитьДействие("ПриИзменении", "ИВМ_СогласованнаяСкидкаПриИзменении");
	//--
КонецПроцедуры

Процедура ДобавитьКнопкуРасчитать(Форма)
	//++ Мещанкин И.В. Задание 11.2.2  02/10/25
	//Добавление команды Пересчитать
	КомандаПересчитать = Форма.Команды.Добавить("Пересчитать");
	КомандаПересчитать.Заголовок = "Пересчитать";
	КомандаПересчитать.Действие = "ИВМ_ПересчитатьПосле";
	
	//Добавление кнопки
	КнопкаПересчитать = Форма.Элементы.Добавить("Пересчитать", Тип("КнопкаФормы"), Форма.Элементы.Скидка);
	КнопкаПересчитать.Заголовок = "Пересчитать";
	КнопкаПересчитать.ИмяКоманды = "Пересчитать";
	//--
	
КонецПроцедуры




Процедура ВставитьПолеКонтактноеЛицоНаФормуПередСуммаДокумента(Форма)
	//++ Мещанкин И.В. Задание 11.2.2  02/10/25
	
	ПолеВвода = Форма.Элементы.Вставить("ИВМ_КонтактноеЛицо", Тип("ПолеФормы"), , Форма.Элементы.СуммаДокумента);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.ИВМ_КонтактноеЛицо";
	//--
КонецПроцедуры


#КонецОбласти